app/controllers/admin/posts_controller.rb

SELECT  "posts".* FROM "posts"   ORDER BY created_at DESC LIMIT 30 OFFSET 0
---
  def index
    @posts = Post.paginate(:page => params[:page])

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "If this works holy shit"], ["created_at", "2014-07-03 21:30:26.159791"], ["updated_at", "2014-07-03 21:30:26.159791"]]
---
  def create
    @post = Post.new(post_params)
    flash[:notice] = 'Post created successfully' if @post.save