app/controllers/static_pages_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY created_at DESC
---
  def home
    @posts = Post.all.to_a